JBHarvey/design-iii/src/stm32/dev/src/main.c
			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 75);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 75);

			Delayms(1000);

			MotorSetDirection(1, COUNTER_CLOCK);
			MotorSetDirection(2, COUNTER_CLOCK);
			MotorSetDirection(3, CLOCK);
			MotorSetDirection(4, CLOCK);

			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 75);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 75);

			Delayms(1000);

			MotorSetDirection(1, COUNTER_CLOCK);
			MotorSetDirection(2, CLOCK);
			MotorSetDirection(3, CLOCK);
			MotorSetDirection(4, COUNTER_CLOCK);

			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 75);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 75);

			Delayms(1000);

			MotorSetDirection(1, BRAKE_G);
			MotorSetDirection(2, BRAKE_G);
			MotorSetDirection(3, BRAKE_G);
			MotorSetDirection(4, BRAKE_G);

			MotorSetSpeed(1, 0);
			MotorSetSpeed(2, 0);
			MotorSetSpeed(3, 0);
			MotorSetSpeed(4, 0);

			mainState = MAIN_MANCH;

			break;
		case MAIN_PID:

			//PID_POSITION1.mySetpoint = 0.00;
			//PID_POSITION2.mySetpoint = 0.00;
			//PID_POSITION3.mySetpoint = 0.00;
			//PID_POSITION4.mySetpoint = 0.00;

			while (1) {

				if (PID_Compute_Position(&PID_POSITION1)) {
					//&& PID_Compute_Position(&PID_POSITION2)
					//&& PID_Compute_Position(&PID_POSITION3)
					//&& PID_Compute_Position(&PID_POSITION4)) {
					float positionOutput1 = PID_POSITION1.myOutput;
					int cmdMotor1;
					PID_SPEED1.mySetpoint = positionOutput1;

					if (PID_Compute_Speed(&PID_SPEED1)) {
						cmdMotor1 = PID_SPEED1.myOutput;
						if (cmdMotor1 > 0) {
							MotorSetDirection(1, COUNTER_CLOCK);
						} else if (cmdMotor1 < 0) {
							MotorSetDirection(1, CLOCK);
							cmdMotor1 = -cmdMotor1;
						} else {
							speedDirection1 = SPEED_DIRECTION_NONE;
							MotorSetDirection(1, BRAKE_G);
						}

						MotorSetSpeed(1, cmdMotor1);
						PID_SetMode(&PID_SPEED1, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges1);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor1);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);

						/* send position to USB */
						/*TM_USB_VCP_Putc(2);
						 TM_USB_VCP_Putc(8);
						 VCP_DataTx((uint8_t*) &positionOutput, sizeof(float));
						 VCP_DataTx((uint8_t*) &positionOutput, sizeof(float));*/
					}
				}

				/*PID_SPEED3.mySetpoint = positionOutput;

				 if (PID_Compute_Speed(&PID_SPEED3)) {

				 int cmdMotor3 = PID_SPEED3.myOutput;

				 if (cmdMotor3 > 0) {
				 speedDirection3 = SPEED_DIRECTION_FORWARD;
				 MotorSetDirection(3, CLOCK);
				 //MotorSetDirection(1, CLOCK);
				 } else if (cmdMotor3 < 0) {

				 speedDirection3 = SPEED_DIRECTION_BACKWARD;
				 MotorSetDirection(3, COUNTER_CLOCK);
				 //MotorSetDirection(1, CLOCK);
				 cmdMotor3 = -cmdMotor3;
				 } else {
				 speedDirection3 = SPEED_DIRECTION_NONE;
				 MotorSetDirection(3, BRAKE_G);
				 }

				 MotorSetSpeed(3, cmdMotor3);
				 PID_SetMode(&PID_SPEED3, PID_Mode_Manual);
				 }
				 }*/

				if (PID_Compute_Position(&PID_POSITION2)) {
					float positionOutput2 = PID_POSITION2.myOutput;
					PID_SPEED2.mySetpoint = positionOutput2;
					int cmdMotor2;

					if (PID_Compute_Speed(&PID_SPEED2)) {
						cmdMotor2 = PID_SPEED2.myOutput;
						if (cmdMotor2 > 0) {
							MotorSetDirection(2, COUNTER_CLOCK);
							//MotorSetDirection(4, CLOCK);
						} else if (cmdMotor2 < 0) {
							MotorSetDirection(2, CLOCK);
							cmdMotor2 = -cmdMotor2;
						} else {
							speedDirection2 = SPEED_DIRECTION_NONE;
							MotorSetDirection(2, BRAKE_G);
						}

						MotorSetSpeed(2, cmdMotor2);
						PID_SetMode(&PID_SPEED2, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges2);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor2);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);
					}
				}

				/*PID_SPEED4.mySetpoint = positionOutput;

				 if (PID_Compute_Speed(&PID_SPEED4)) {
				 int cmdMotor4 = PID_SPEED4.myOutput;

				 if (cmdMotor4 > 0) {
				 speedDirection4 = SPEED_DIRECTION_FORWARD;
				 MotorSetDirection(4, CLOCK);
				 //MotorSetDirection(2, COUNTER_CLOCK);
				 } else if (cmdMotor4 < 0) {

				 speedDirection4 = SPEED_DIRECTION_BACKWARD;
				 MotorSetDirection(4, COUNTER_CLOCK);
				 //MotorSetDirection(2, CLOCK);
				 cmdMotor4 = -cmdMotor4;
				 } else {
				 speedDirection4 = SPEED_DIRECTION_NONE;
				 MotorSetDirection(4, BRAKE_G);
				 //MotorSetDirection(2, BRAKE_G);

				 }

				 MotorSetSpeed(4, cmdMotor4);
				 PID_SetMode(&PID_SPEED4, PID_Mode_Manual);
				 }*/

				if (PID_Compute_Position(&PID_POSITION3)) {
					float positionOutput3 = PID_POSITION3.myOutput;
					PID_SPEED3.mySetpoint = positionOutput3;

					int cmdMotor3;

					if (PID_Compute_Speed(&PID_SPEED3)) {
						cmdMotor3 = PID_SPEED3.myOutput;
						if (cmdMotor3 > 0) {
							MotorSetDirection(3, CLOCK);
						} else if (cmdMotor3 < 0) {
							MotorSetDirection(3, COUNTER_CLOCK);
							cmdMotor3 = -cmdMotor3;
						} else {
							speedDirection3 = SPEED_DIRECTION_NONE;
							MotorSetDirection(3, BRAKE_G);
						}

						MotorSetSpeed(3, cmdMotor3);
						PID_SetMode(&PID_SPEED3, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges3);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor3);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);
					}
				}

				if (PID_Compute_Position(&PID_POSITION4)) {
					float positionOutput4 = PID_POSITION4.myOutput;
					PID_SPEED4.mySetpoint = positionOutput4;

