JBHarvey/design-iii/src/stm32/dev/src/main.c
					int cmdMotor4;

					if (PID_Compute_Speed(&PID_SPEED4)) {
						cmdMotor4 = PID_SPEED4.myOutput;
						if (cmdMotor4 > 0) {
							MotorSetDirection(4, CLOCK);
						} else if (cmdMotor4 < 0) {
							MotorSetDirection(4, COUNTER_CLOCK);
							cmdMotor4 = -cmdMotor4;
						} else {
							speedDirection4 = SPEED_DIRECTION_NONE;
							MotorSetDirection(4, BRAKE_G);

						}

						MotorSetSpeed(4, cmdMotor4);
						PID_SetMode(&PID_SPEED4, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges4);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor4);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);

					}

					//MotorSetSpeed(1, cmdMotor1);
					//PID_SetMode(&PID_SPEED1, PID_Mode_Manual);

					//MotorSetSpeed(2, cmdMotor2);
					//PID_SetMode(&PID_SPEED2, PID_Mode_Manual);

					//MotorSetSpeed(3, cmdMotor3);
					//PID_SetMode(&PID_SPEED3, PID_Mode_Manual);

					//MotorSetSpeed(4, cmdMotor4);
					//PID_SetMode(&PID_SPEED4, PID_Mode_Manual);

				}
			}
			break;
		case MAIN_MANCH:
			tryToDecodeManchesterCode(&manchesterState, manchesterBuffer,
					&manchesterFigureVerification,
					manchesterOrientationVerification,
					&manchesterFactorVerification);
			break;
		default:
			setState(&mainState, MAIN_IDLE);
		}
	}
}

extern void EXTI4_IRQHandler(void) {
	if (EXTI_GetITStatus(EXTI_Line4) != RESET) {
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line4);
		manchesterState = MANCHESTER_FIRST;
		InitializeTimer5();
		EnableTimer5Interrupt();
		disableExternalInterruptLine4();
	}

}

extern void EXTI9_5_IRQHandler(void) {
	/* Make sure that interrupt flag is set */
	// wheel 1 channel 1
	if (EXTI_GetITStatus(EXTI_Line5) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges1++;

		wheel1Channel1UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_5);
		wheel1Channel2UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6);

		// check wheel 1 channel 2
		if (wheel1Channel1UP == wheel1Channel2UP) {

			numberOfPositionEdges1++;
			incWheel1Canal1EncoderCounter++;
			speedDirection1 = SPEED_DIRECTION_FORWARD;

		} else {
			numberOfPositionEdges1--;
			decWheel1Canal1EncoderCounter++;
			speedDirection1 = SPEED_DIRECTION_BACKWARD;
		}

		/*if (speedDirection1 == SPEED_DIRECTION_FORWARD) {
		 numberOfPositionEdges1++;
		 incWheel1Canal1EncoderCounter++;
		 } else if (speedDirection1 == SPEED_DIRECTION_BACKWARD) {
		 numberOfPositionEdges1--;
		 decWheel1Canal1EncoderCounter++;
		 }*/

		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line5);
	}

	if (EXTI_GetITStatus(EXTI_Line6) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges1++;

		wheel1Channel1UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_5);
		wheel1Channel2UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6);

		// check wheel 1
		if (wheel1Channel1UP != wheel1Channel2UP) {
			numberOfPositionEdges1++;
			incWheel1Canal2EncoderCounter++;
			speedDirection1 = SPEED_DIRECTION_FORWARD;
		} else {
			numberOfPositionEdges1--;
			decWheel1Canal2EncoderCounter++;
			speedDirection1 = SPEED_DIRECTION_BACKWARD;
		}

		/*if (speedDirection1 == SPEED_DIRECTION_FORWARD) {
		 numberOfPositionEdges1++;
		 incWheel1Canal2EncoderCounter++;
		 } else if (speedDirection1 == SPEED_DIRECTION_BACKWARD) {
		 numberOfPositionEdges1--;
		 decWheel1Canal2EncoderCounter++;
		 }*/

		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line6);
	}

	if (EXTI_GetITStatus(EXTI_Line8) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges2++;

		wheel2Channel1UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_8);
		wheel2Channel2UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_9);

		// check wheel 2
		if (wheel2Channel1UP == wheel2Channel2UP) {

			numberOfPositionEdges2++;
			incWheel2Canal1EncoderCounter++;
			speedDirection2 = SPEED_DIRECTION_FORWARD;

		} else {
			numberOfPositionEdges2--;
			decWheel2Canal1EncoderCounter++;
			speedDirection2 = SPEED_DIRECTION_BACKWARD;
		}

		/*if (speedDirection2 == SPEED_DIRECTION_FORWARD) {
		 numberOfPositionEdges2++;
		 incWheel2Canal1EncoderCounter++;
		 } else if (speedDirection2 == SPEED_DIRECTION_BACKWARD) {
		 numberOfPositionEdges2--;
		 decWheel2Canal1EncoderCounter++;

		 }*/
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line8);
	}

	if (EXTI_GetITStatus(EXTI_Line9) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges2++;

		wheel2Channel1UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_8);
		wheel2Channel2UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_9);

		// check wheel 2
		if (wheel2Channel1UP != wheel2Channel2UP) {
			numberOfPositionEdges2++;
			incWheel2Canal2EncoderCounter++;
			speedDirection2 = SPEED_DIRECTION_FORWARD;

		} else {
			numberOfPositionEdges2--;
			decWheel2Canal2EncoderCounter++;
			speedDirection2 = SPEED_DIRECTION_BACKWARD;
		}

		/*if (speedDirection2 == SPEED_DIRECTION_FORWARD) {
		 numberOfPositionEdges2++;
		 incWheel2Canal2EncoderCounter++;
		 } else if (speedDirection2 == SPEED_DIRECTION_BACKWARD) {
		 numberOfPositionEdges2--;
		 decWheel2Canal2EncoderCounter++;
		 }*/

		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line9);
	}
}

extern void EXTI15_10_IRQHandler(void) {
	/* Make sure that interrupt flag is set */
	if (EXTI_GetITStatus(EXTI_Line10) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges3++;

		wheel3Channel1UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_10);
		wheel3Channel2UP = GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_11);

		// check wheel 3
		if (wheel3Channel1UP != wheel3Channel2UP) {
			numberOfPositionEdges3++;
			incWheel3Canal1EncoderCounter++;
			speedDirection3 = SPEED_DIRECTION_FORWARD;
		} else {
			numberOfPositionEdges3--;
			decWheel3Canal1EncoderCounter++;
			speedDirection3 = SPEED_DIRECTION_BACKWARD;
		}

		/*if (speedDirection3 == SPEED_DIRECTION_FORWARD) {
		 numberOfPositionEdges3++;
		 incWheel3Canal1EncoderCounter++;
		 } else if (speedDirection3 == SPEED_DIRECTION_BACKWARD) {
		 numberOfPositionEdges3--;
		 decWheel3Canal1EncoderCounter++;

